uhnp/src/Documents/ВерсияДокументацииЗакупочныхПроцедур/ВерсияДокументацииЗакупочныхПроцедур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВерсияДокументацииЗакупочныхПроцедур</name>
  <basedOn>Catalog.ЗакупочныеПроцедуры</basedOn>
  <basedOn>Document.ВерсияДокументацииЗакупочныхПроцедур</basedOn>
  <attributes>
    <name>ЗакупочнаяПроцедура</name>
    <type>
      <types>CatalogRef.ЗакупочныеПроцедуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособыВыбораПоставщика</name>
    <type>
      <types>CatalogRef.СпособыВыбораПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытаяЗакупка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭТП</name>
    <type>
      <types>CatalogRef.ЭлектронныеТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяКвалификационныйОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодыОценкиПредложенийПоставщиков</name>
    <type>
      <types>EnumRef.МетодыОценкиПредложенийПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйФайл</name>
    <type>
      <types>CatalogRef.ВерсияДокументацииЗакупочныхПроцедурПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсииДокументации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаЗакупочнойПроцедуры</name>
    <type>
      <types>EnumRef.ВидДокументаЗакупочнойПроцедуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоЗакупочнойПроцедуре</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СовместнаяЗакупка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВЭлектроннойФорме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Переторжка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСозданияДоговора</name>
    <type>
      <types>EnumRef.СпособСозданияДоговора</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьДокументациюНаЕИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АрхивныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизитыДопСвойств</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Enums/ВидДокументаЗакупочнойПроцедуры/ВидДокументаЗакупочнойПроцедуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДокументаЗакупочнойПроцедуры</name>
  <enumValues>
    <name>ИзвещениеОЗакупках</name>
  </enumValues>
  <enumValues>
    <name>ПротоколВыбораПобедителя</name>
  </enumValues>
  <enumValues>
    <name>ПроектДоговора</name>
  </enumValues>
  <enumValues>
    <name>ТехническоеЗадание</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ВерсияДокументацииЗакупочныхПроцедур/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	МодульСогласованияДокументовУХ.ПриСозданииНаСервереОбъект(ЭтаФорма);
	

	НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	УстановитьУсловноеОформлениеФормы(); 
	Если Параметры.Свойство("ЗакупочнаяПроцедура") Тогда
		ЗаполнитьНаОсновании(Параметры.ЗакупочнаяПроцедура);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаОсновании(ДанныеЗаполнения)
		// Заполнение шапки
		Объект.ЗакрытаяЗакупка = ДанныеЗаполнения.ЗакрытаяЗакупка;
		Объект.Организация = ДанныеЗаполнения.ОрганизацияДляЗаключенияДоговора;
		Объект.СпособыВыбораПоставщика = ДанныеЗаполнения.СпособВыбораПоставщика;
		Объект.ЗакупочнаяПроцедура = ДанныеЗаполнения.Ссылка;
		Объект.ЭТП = ДанныеЗаполнения.ЭТП;     
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Объект.ЗакупочнаяПроцедура);     
        Объект.ВидДокументаЗакупочнойПроцедуры = Перечисления.ВидДокументаЗакупочнойПроцедуры.ИзвещениеОЗакупках;
		
		Объект.ДополнительныеРеквизитыДопСвойств.Загрузить(ДанныеЗаполнения.ДополнительныеРеквизиты.Выгрузить());    
		Объект.ВЭлектроннойФорме = Объект.ЗакупочнаяПроцедура.ВЭлектроннойФорме; 
		Объект.СуммаПоЗакупочнойПроцедуре = Справочники.ЗакупочныеПроцедуры.РасчитатьСуммуПоЛотам(
		Объект.ЗакупочнаяПроцедура,
		Объект.ЗакупочнаяПроцедура.ВалютаДокумента,
		ТекущаяДатаСеанса());
		Если Объект.СуммаПоЗакупочнойПроцедуре < 500000 Тогда
			Объект.СуммаПоЗакупочнойПроцедуре = 0;
		Иначе
			Объект.СуммаПоЗакупочнойПроцедуре = 1;
		КонецЕсли;	 
		Объект.НомерВерсииДокументации = Документы.ВерсияДокументацииЗакупочныхПроцедур.УстановитьНомерДокументации(Объект.ЗакупочнаяПроцедура);
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()
	
	СписокЗначенийДопРеквизитов = Справочники.ЗакупочныеПроцедуры.ПолучитьВсеСвойстваНастроекДопРеквизитов();
	СчетчикДляГруппы = 0;
	Счетчик = 0;
	Для Каждого Элемент ИЗ СписокЗначенийДопРеквизитов Цикл
		
		Если СчетчикДляГруппы = 0 Тогда
			ГруппаШапка = ЭтаФорма.Элементы.Добавить("ГруппаДопРеквизит"+Счетчик, Тип("ГруппаФормы"),Элементы.ГруппаДополнительныеРеквизиты);
			ГруппаШапка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаШапка.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаШапка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаШапка.РастягиватьПоГоризонтали = ИСТИНА;
		КонецЕсли;
		Реквизиты = Новый Массив;

		Реквизиты.Добавить(Новый РеквизитФормы(Элемент.Значение.ИдентификаторДляФормул,Новый ОписаниеТипов(Элемент.Значение.ТипЗначения),,Элемент.Значение.Заголовок));
		ЭтаФорма.ИзменитьРеквизиты(Реквизиты);
		
		ПолеВвода = Элементы.Добавить(Элемент.Значение.ИдентификаторДляФормул,Тип("ПолеФормы"),Элементы.ГруппаДополнительныеРеквизиты);	    
		
		ПолеВвода.Заголовок = Элемент.Значение.Заголовок;
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = Элемент.Значение.ИдентификаторДляФормул;		
		СчетчикДляГруппы = СчетчикДляГруппы + 1;
		
		Если СчетчикДляГруппы = 2 Тогда
			СчетчикДляГруппы = 0;
		КонецЕсли;	
		Счетчик = Счетчик + 1;
	КонецЦикла;	
	
	УстановитьЗначенияДопСвойств();
	Если Объект.ВЭлектроннойФорме Тогда
		Элементы.ЭТП.Видимость = Истина;
	Иначе
		Элементы.ЭТП.Видимость = Ложь;
	КонецЕсли;
 	УстановитьВидимостьКомандПрикрепления();
	
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимостьКомандПрикрепления()
	
	Если Объект.ВидДокументаЗакупочнойПроцедуры = ПредопределенноеЗначение("Перечисление.ВидДокументаЗакупочнойПроцедуры.ТехническоеЗадание")
		ИЛИ Объект.ВидДокументаЗакупочнойПроцедуры = ПредопределенноеЗначение("Перечисление.ВидДокументаЗакупочнойПроцедуры.ПроектДоговора") 
		Тогда 
		Элементы.ГруппаДобавленияФайла.Видимость = Ложь;
		Элементы.ДобавитьФайлЗакупочнойПроцедурыОтдельно.Видимость = Истина;
	Иначе 
		Элементы.ГруппаДобавленияФайла.Видимость = Истина;  
		Элементы.ДобавитьФайлЗакупочнойПроцедурыОтдельно.Видимость = Ложь;
	КонецЕсли;	
	
	
КонецПроцедуры	
	
&НаСервере
Процедура УстановитьЗначенияДопСвойств()
	
	Для Каждого Элемент ИЗ СписокЗначенийДопРеквизитов Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Свойство", Элемент.Значение);
		Если Объект.ДополнительныеРеквизитыДопСвойств.НайтиСтроки(СтруктураПоиска).Количество() > 0 Тогда
			ЭтаФорма[Элемент.Значение.ИдентификаторДляФормул] = Объект.ДополнительныеРеквизитыДопСвойств.НайтиСтроки(СтруктураПоиска)[0].Значение ;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта()
	МодульСогласованияДокументовУХ.НарисоватьПанельСогласования(Элементы, ЭтаФорма);
	ЭтаФорма.Команды["ПринятьКСогласованию"].Действие	 = "ПринятьКСогласованию_Подключаемый";
	ЭтаФорма.Команды["ИсторияСогласования"].Действие	 = "ИсторияСогласования_Подключаемый";
	ЭтаФорма.Команды["СогласоватьДокумент"].Действие	 = "СогласоватьДокумент_Подключаемый";
	ЭтаФорма.Команды["ОтменитьСогласование"].Действие	 = "ОтменитьСогласование_Подключаемый";
	ЭтаФорма.Команды["МаршрутСогласования"].Действие	 = "МаршрутСогласования_Подключаемый";
	ОпределитьСостояниеОбъекта();
	ЭлементСтатусОбъекта = Элементы.Найти("СтатусОбъекта");
	Если ЭлементСтатусОбъекта <> Неопределено Тогда
		Если ЭлементСтатусОбъекта.Вид = ВидПоляФормы.ПолеВвода Тогда
			ЭлементСтатусОбъекта.УстановитьДействие("ОбработкаВыбора", "СтатусОбъектаОбработкаВыбора"); 
		Иначе
			// В прочих случаях не устанавливаем обработчик выбора.
		КонецЕсли;
	Иначе
		// Нет элемента Статус объекта.
	КонецЕсли;
	#Если НЕ ВебКлиент Тогда
	ДействияСогласованиеУХСервер.УстановитьДействиеПриИзмененииСогласованияОрганизации(ЭтаФорма);
	#КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ОпределитьСостояниеОбъекта()
	ДействияСогласованиеУХСервер.ОпределитьСостояниеЗаявки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбъектаПриИзменении_Подключаемый()
	НовоеЗначениеСтатуса = РеквизитСтатусОбъекта(ЭтаФорма);
	ПроверитьСохранениеИзменитьСтатус(НовоеЗначениеСтатуса);	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСтатусОбъекта(ФормаВход)
	Возврат ФормаВход["СтатусОбъекта"];
КонецФункции

&НаКлиенте
Процедура СтатусОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = РеквизитСтатусОбъекта(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьСохранениеИзменитьСтатус(ВыбранноеЗначение);
КонецПроцедуры


// Проверяет сохранение текущего объекта и изменяет его статус
// НовоеЗначениеСтатусаВход.
&НаКлиенте
Процедура ПроверитьСохранениеИзменитьСтатус(НовоеЗначениеСтатусаВход)
	Если (Объект.Ссылка.Пустая()) ИЛИ (ЭтаФорма.Модифицированность) Тогда
		СтруктураПараметров = Новый Структура("ВыбранноеЗначение", НовоеЗначениеСтатусаВход);
		ОписаниеОповещения = Новый ОписаниеОповещения("СостояниеЗаявкиОбработкаВыбораПродолжение", ЭтотОбъект, СтруктураПараметров);
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Изменение состояния возможно только после записи данных.
		|Данные будут записаны.'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	ИзменитьСостояниеЗаявкиКлиент(НовоеЗначениеСтатусаВход);	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбораПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Записать();
		ИзменитьСостояниеЗаявкиКлиент(Параметры.ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение)
	ДействияСогласованиеУХКлиент.ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ИзменитьСостояниеЗаявки(Ссылка, Состояние)
	
	Возврат УправлениеПроцессамиСогласованияУХ.ПеревестиЗаявкуВПроизвольноеСостояние(Ссылка, Состояние, , , ЭтаФорма);
	
КонецФункции

&НаКлиенте
Процедура ПринятьКСогласованию_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ПринятьКСогласованию(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ИсторияСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьДокумент_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.СогласоватьДокумент(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСогласование_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ОтменитьСогласование(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МаршрутСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.МаршрутСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьНовыйФайлЗакупочнойПроцедуры(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Перед созданием файла закупочной документации необходимо записать версию закупочной документации");
		
    Иначе
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВладелецФормы",ЭтаФорма);
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОбъектПечати",   Объект.ЗакупочнаяПроцедура);
	ПараметрыФормы.Вставить("ВерсияДокументации",   Объект.Ссылка);
	
	ПараметрыФормы.Вставить("ШаблонДоговора", );
	
	ОткрытьФорму("Документ.ВерсияДокументацииЗакупочныхПроцедур.Форма.ФормаРедактированияТекстаЗакупочнойПроцедуры", 
		ПараметрыФормы,
		ДополнительныеПараметры.ВладелецФормы,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ПрисоединенныйФайлЗакупочнойПроцедурыОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФайл();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл()
	
		ДанныеФайла = ПолучитьДанныеФайла(Объект.ПрисоединенныйФайл, УникальныйИдентификатор);
		ФайлРедактируется = ФайлРедактируется(Объект.ПрисоединенныйФайл);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, ФайлРедактируется);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(Знач ПрисоединенныйФайл,
	Знач ИдентификаторФормы = Неопределено,
	Знач ПолучатьСсылкуНаДвоичныеДанные = Истина)
	
	Возврат РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл, ИдентификаторФормы, ПолучатьСсылкуНаДвоичныеДанные);
	
КонецФункции

&НаСервереБезКонтекста
Функция ФайлРедактируется(ФайлДляПросмотра)
	
	Возврат ЗначениеЗаполнено(ФайлДляПросмотра.Редактирует) И ФайлДляПросмотра.Редактирует = Пользователи.АвторизованныйПользователь();
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	#Область УниверсальныеПроцессыСогласование
	Если ИмяСобытия = "ОбъектСогласован"
				ИЛИ ИмяСобытия = "ОбъектОтклонен"
				ИЛИ ИмяСобытия = "МаршрутИнициализирован"
				ИЛИ ИмяСобытия = "СостояниеЗаявкиПриИзменении" Тогда
		ОпределитьСостояниеОбъекта(); 
		
	КонецЕсли;
	#КонецОбласти 	
	Если ИмяСобытия = "УстановитьФайлЗакупочнойПроцедуры" Тогда
		Если Параметр.Свойство("ПрисоединенныйФайл") И ЗначениеЗаполнено(Параметр.ПрисоединенныйФайл) Тогда
			Объект.ПрисоединенныйФайл = Параметр.ПрисоединенныйФайл;
		КонецЕсли;	
	ИначеЕсли ИмяСобытия = "Запись_Файл" И Параметр.Владелец = Объект.Ссылка Тогда
		Объект.ПрисоединенныйФайл = Источник[0];
		ЭтотОбъект.Модифицированность = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВЭлектроннойФормеПриИзменении(Элемент)
	Если Объект.ВЭлектроннойФорме Тогда
	//	Элементы.СпособСозданияДоговора.Видимость  = Истина;
		Элементы.ЭТП.Видимость  = Истина;
	Иначе
	//	Элементы.СпособСозданияДоговора.Видимость  = Ложь;
		Элементы.ЭТП.Видимость  = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл1(Команда)
	Если ЗначениеЗаполнено(Объект.ПрисоединенныйФайл) Тогда
		ОткрытьФайлДляПросмотра(Объект.ПрисоединенныйФайл);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлДляПросмотра(ФайлДляПросмотра)
	
	Если ФайлЗашифрован(ФайлДляПросмотра) Тогда
		Возврат;
	КонецЕсли;
	
	ВходитВПереченьЗапрещенныхРасширений = ПроверитьВходитВПереченьЗапрещенныхРасширений(ФайлДляПросмотра);
	ДополнительныеПараметры = Новый Структура("ФайлДляПросмотра",ФайлДляПросмотра);
	Если ВходитВПереченьЗапрещенныхРасширений Тогда
		Оповещение = Новый ОписаниеОповещения("ОткрытьФайлПослеПодтверждения", ЭтотОбъект, ДополнительныеПараметры);
		ПараметрыФормы = Новый Структура("Ключ", "ПередОткрытиемФайла");
		ОткрытьФорму("ОбщаяФорма.ПредупреждениеБезопасности", ПараметрыФормы, , , , , Оповещение);
		Возврат;
	Иначе
		ОткрытьФайлПослеПодтверждения("Продолжить",ДополнительныеПараметры);
	КонецЕсли;
	     	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФайлПослеПодтверждения(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ФайлДляПросмотра = ДополнительныеПараметры.ФайлДляПросмотра;
	
	Если РезультатВыбора = "Продолжить" Тогда
		ДанныеФайла = ПолучитьДанныеФайла(ФайлДляПросмотра, УникальныйИдентификатор);
		ФайлРедактируется = ФайлРедактируется(ФайлДляПросмотра);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, ФайлРедактируется);	
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ФайлЗашифрован(ФайлДляПросмотра)
	
	Возврат ФайлДляПросмотра.Зашифрован;
	
КонецФункции


&НаСервереБезКонтекста
Функция ПроверитьВходитВПереченьЗапрещенныхРасширений(ФайлДляПросмотра)
	
	ЗапрещенныеРасширения = РаботаСФайламиСлужебный.СписокЗапрещенныхРасширений();
	Возврат ЗапрещенныеРасширения.НайтиПоЗначению(ФайлДляПросмотра.Расширение) <> Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьФайлЗакупочнойПроцедуры(Команда)    
	
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
		
	РаботаСФайламиКлиент.ДобавитьФайлы(
			Объект.Ссылка, 
			УникальныйИдентификатор,,,);
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаЗакупочнойПроцедурыПриИзменении(Элемент)
	УстановитьВидимостьКомандПрикрепления();
КонецПроцедуры
